"use strict";


/*===============================================*/
/* Калькулятор с помощью функции глобального объекта "eval"  */



const person = "Ruslan"
alert("Hello," + person);

if (confirm("Are you ready?")) {
   alert("Go")
} else {
   alert("Incorrect choice")
}
   
   

const operandA = prompt("Enter operanda A");
const OPERATOR = prompt("Enter operator:+,-,/*,");
const operandB = prompt("Enter operand B");
alert(eval(operandA + OPERATOR + operandB));


/*===========================================================================*/
/*  Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
   Проверьте работу скрипта при a, равном 1, 0, -3..*/


/* 1.Решение:
let a = 0;
let b = a >= 0 ? 'Верно' : "Не верно"
console.log(b)
 */

/* 2.Решение:
console.log(3 >= 0 ? "Верно" : "Не верно") */
/*===========================================================================*/
/*Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
Проверьте работу скрипта при a, равном 1, 0, -3.*/

/* 1.Решение:
   let a = 0;
   let b = a <= 0 ? "Верно" : "Не верно"
 console.log(b) */


/* 2.Решение:
console.log(3 <= 0 ? "Верно" : "Не верно") */

/*============================================================================*/
/*Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
   Проверьте работу скрипта при a, равном 1, 0, -3.*/

/* 1.Решение:
let a = 1;
let b = a != 0 ? "Верно" : "Не верно"
console.log(b) */

/* 2.Решение:
console.log(1 != 0 ? "Верно" : "Не верно") */


/*=========================*/